<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  




<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Android," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="Android&amp;#x7AEF;&amp;#x5B9E;&amp;#x73B0;TCP&amp;#x957F;&amp;#x8FDE;&amp;#x63A5;&amp;#x573A;&amp;#x666F;&amp;#x5176;&amp;#x5B9E;&amp;#x4E0D;&amp;#x591A;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x6700;&amp;#x719F;&amp;#x6089;&amp;#x7684;&amp;#x4E0D;&amp;#x8FC7;&amp;#x63A8;&amp;#x9001;&amp;#x548">
<meta name="keywords" content="Android">
<meta property="og:type" content="article">
<meta property="og:title" content="Android端TCP长连接的性能优化指北">
<meta property="og:url" content="http://yoursite.com/2018/03/10/Android端TCP长连接性能优化指北/index.html">
<meta property="og:site_name" content="冰冰的博客">
<meta property="og:description" content="Android&amp;#x7AEF;&amp;#x5B9E;&amp;#x73B0;TCP&amp;#x957F;&amp;#x8FDE;&amp;#x63A5;&amp;#x573A;&amp;#x666F;&amp;#x5176;&amp;#x5B9E;&amp;#x4E0D;&amp;#x591A;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x6700;&amp;#x719F;&amp;#x6089;&amp;#x7684;&amp;#x4E0D;&amp;#x8FC7;&amp;#x63A8;&amp;#x9001;&amp;#x548">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2018-03-10T16:39:05.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Android端TCP长连接的性能优化指北">
<meta name="twitter:description" content="Android&amp;#x7AEF;&amp;#x5B9E;&amp;#x73B0;TCP&amp;#x957F;&amp;#x8FDE;&amp;#x63A5;&amp;#x573A;&amp;#x666F;&amp;#x5176;&amp;#x5B9E;&amp;#x4E0D;&amp;#x591A;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x6700;&amp;#x719F;&amp;#x6089;&amp;#x7684;&amp;#x4E0D;&amp;#x8FC7;&amp;#x63A8;&amp;#x9001;&amp;#x548">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> Android端TCP长连接的性能优化指北 | 冰冰的博客 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">冰冰的博客</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            时间线
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-github">
          <a href="/github" rel="section">
            
              <i class="menu-item-icon fa fa-github-alt fa-fw"></i> <br />
            
            GitHub
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            脸白的我
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Android端TCP长连接的性能优化指北
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2018-03-10T23:09:47+08:00" content="2018-03-10">
              2018-03-10
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2018/03/10/Android端TCP长连接性能优化指北/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2018/03/10/Android端TCP长连接性能优化指北/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>Android&#x7AEF;&#x5B9E;&#x73B0;TCP&#x957F;&#x8FDE;&#x63A5;&#x573A;&#x666F;&#x5176;&#x5B9E;&#x4E0D;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x719F;&#x6089;&#x7684;&#x4E0D;&#x8FC7;&#x63A8;&#x9001;&#x548C;HTTP&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x73B0;&#xFF08;OkHttp&#xFF09;&#xFF0C;&#x672C;&#x6587;&#x8BA8;&#x8BBA;&#x7684;&#x662F;&#x5728;&#x5B9E;&#x73B0;<code>&#x63A8;&#x9001;</code>&#x957F;&#x8FDE;&#x63A5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x600E;&#x4E48;&#x6765;&#x505A;&#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x4E0B;&#x6587;&#x53EA;&#x662F;&#x6211;&#x7684;&#x4E00;&#x70B9;&#x62D9;&#x89C1;&#xFF0C;&#x6709;&#x4E0D;&#x59A5;&#x4E4B;&#x5904;&#x8FD8;&#x671B;&#x6307;&#x51FA;</p>
<h3 id="&#x63A8;&#x9001;&#x957F;&#x8FDE;&#x63A5;"><a href="#&#x63A8;&#x9001;&#x957F;&#x8FDE;&#x63A5;" class="headerlink" title="&#x63A8;&#x9001;&#x957F;&#x8FDE;&#x63A5;"></a>&#x63A8;&#x9001;&#x957F;&#x8FDE;&#x63A5;</h3><p>&#x53EF;&#x4EE5;&#x8BF4;&#x5927;&#x90E8;&#x5206;APP&#x662F;&#x79BB;&#x4E0D;&#x5F00;&#x63A8;&#x9001;&#xFF08;push&#xFF09;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x5E73;&#x5E38;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x63A5;&#x5165;&#x7B2C;&#x4E09;&#x65B9;SDK&#xFF08;&#x6781;&#x5149;&#x3001;&#x4E2A;&#x63A8;&#x7B49;&#xFF09;&#x5C45;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x63A8;&#x9001;&#x670D;&#x52A1;&#xFF0C;&#x4E0D;&#x5149;&#x5BA2;&#x6237;&#x7AEF;&#x8981;&#x7F16;&#x5199;&#x76F8;&#x5E94;&#x7684;Socket&#x901A;&#x4FE1;&#x4EE3;&#x7801;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x66F4;&#x662F;&#x9EBB;&#x70E6;&#xFF0C;&#x8981;&#x5904;&#x7406;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x957F;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#xFF0C;&#x6D88;&#x606F;&#x8FD8;&#x5F97;&#x53CA;&#x65F6;&#x9001;&#x8FBE;&#xFF0C;&#x4E00;&#x4E24;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x662F;&#x5403;&#x4E0D;&#x6D88;&#x3002;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x5199;Socket&#x901A;&#x4FE1;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x662F;&#x8981;&#x5904;&#x7406;&#x4E00;&#x4E9B;&#x5E73;&#x53F0;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x63A8;&#x9001;&#x670D;&#x52A1;&#x8FDB;&#x7A0B;&#x5982;&#x4F55;&#x4FDD;&#x6D3B;&#xFF0C;APP&#x8FDB;&#x7A0B;&#x5982;&#x4F55;&#x8DDF;&#x63A8;&#x9001;&#x670D;&#x52A1;&#x8FDB;&#x7A0B;&#x901A;&#x4FE1;&#xFF0C;&#x5982;&#x4F55;&#x8282;&#x7701;&#x624B;&#x673A;&#x7535;&#x91CF;&#x548C;&#x624B;&#x673A;&#x5F31;&#x7F51;&#x60C5;&#x51B5;&#x4E0B;&#x5982;&#x4F55;&#x63D0;&#x5347;&#x901A;&#x4FE1;&#x8D28;&#x91CF;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4EE5;&#x540E;&#x6709;&#x65F6;&#x95F4;&#x5206;&#x6790;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x770B;&#x770B;TCP&#x957F;&#x8FDE;&#x63A5;&#x6027;&#x80FD;&#x5982;&#x4F55;&#x6765;&#x4F18;&#x5316;</p>
<a id="more"></a>
<h3 id="&#x5F71;&#x54CD;TCP&#x6027;&#x80FD;&#x7684;&#x70B9;"><a href="#&#x5F71;&#x54CD;TCP&#x6027;&#x80FD;&#x7684;&#x70B9;" class="headerlink" title="&#x5F71;&#x54CD;TCP&#x6027;&#x80FD;&#x7684;&#x70B9;"></a>&#x5F71;&#x54CD;TCP&#x6027;&#x80FD;&#x7684;&#x70B9;</h3><p>TCP/IP&#x4F53;&#x7CFB;&#x592A;&#x590D;&#x6742;&#x4E86;&#xFF0C;&#x60F3;&#x5B8C;&#x5168;&#x638C;&#x63E1;&#x786E;&#x5B9E;&#x5F88;&#x56F0;&#x96BE;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x5206;&#x6790;&#x5F71;&#x54CD;TCP&#x6027;&#x80FD;&#x7684;&#x51E0;&#x4E2A;&#x56E0;&#x7D20;&#xFF0C;&#x770B;&#x770B;&#x5728;Android&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4E0D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4F18;&#x5316;</p>
<h4 id="TCP&#x8FDE;&#x63A5;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x65F6;&#x5EF6;"><a href="#TCP&#x8FDE;&#x63A5;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x65F6;&#x5EF6;" class="headerlink" title="TCP&#x8FDE;&#x63A5;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x65F6;&#x5EF6;"></a>TCP&#x8FDE;&#x63A5;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x65F6;&#x5EF6;</h4><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8981;&#x5EFA;&#x7ACB;TCP&#x8FDE;&#x63A5;&#xFF0C;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x6210;&#x529F;&#x540E;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x6210;&#x529F;</p>
<ul>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x65B0;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x9700;&#x8981;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x8BBE;&#x7F6E;&#x4E86;<code>SYN</code>&#x6807;&#x8BB0;&#x7684;&#x5206;&#x7EC4;&#xFF0C;&#x5411;&#x670D;&#x52A1;&#x5668;&#x8BF4;&#x660E;&#x8FD9;&#x4E09;&#x4E2A;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;</li>
<li>&#x5982;&#x4F55;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x53D7;&#x4E86;&#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x4F1A;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x56DE;&#x9001;&#x4E00;&#x4E2A;&#x8BBE;&#x7F6E;&#x4E86;<code>SYN</code>&#x548C;<code>ACK</code>&#x7684;&#x5206;&#x7EC4;&#xFF0C;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x8BF4;&#x660E;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x5DF2;&#x7ECF;&#x88AB;&#x63A5;&#x53D7;&#x4E86;</li>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x6536;&#x5230;&#x8FD9;&#x4E2A;&#x8868;&#x660E;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x88AB;&#x63A5;&#x53D7;&#x7684;&#x5206;&#x7EC4;&#x540E;&#xFF0C;&#x8981;&#x53D1;&#x9001;&#x4E00;&#x6761;&#x643A;&#x5E26;<code>ACK</code>&#x6807;&#x8BB0;&#x7684;&#x786E;&#x8BA4;&#x6D88;&#x606F;&#xFF08;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x4E2D;&#x643A;&#x5E26;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#xFF09;&#x8868;&#x660E;&#x8FDE;&#x63A5;&#x5DF2;&#x7ECF;&#x5EFA;&#x7ACB;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x53D1;&#x9001;&#x6570;&#x636E;&#x4E86;</li>
</ul>
<p>&#x90A3;&#x5EFA;&#x7ACB;TCP&#x8FDE;&#x63A5;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x65F6;&#x5EF6;&#x5BF9;&#x6211;&#x4EEC;&#x4F1A;&#x6709;&#x5F71;&#x54CD;&#x5417;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x6CA1;&#x6709;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x5F53;HTTP&#x8BF7;&#x6C42;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x7136;&#x540E;&#x5462;&#x8FD9;&#x6837;&#x7684;HTTP&#x8BF7;&#x6C42;&#x53C8;&#x975E;&#x5E38;&#x9891;&#x7E41;&#xFF0C;&#x8FD9;&#x6837;&#x7B97;&#x4E0B;&#x6765;&#xFF0C;&#x63E1;&#x624B;&#x4EA7;&#x751F;&#x7684;&#x65F6;&#x5EF6;&#x5360;&#x6BD4;&#x5C31;&#x5F88;&#x9AD8;&#x4E86;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x8981;&#x901A;&#x8FC7;&#x91CD;&#x7528;&#x5DF2;&#x6709;&#x7684;&#x8FDE;&#x63A5;&#x6765;&#x51CF;&#x5C11;&#x8FDE;&#x63A5;&#x7684;&#x6B21;&#x6570;&#x3002;&#x800C;&#x63A8;&#x9001;&#x957F;&#x8FDE;&#x63A5;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5728;&#x4FDD;&#x6301;&#x8FDE;&#x63A5;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x65E0;&#x9700;&#x5728;&#x8FD9;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x4F18;&#x5316;</p>
<h4 id="&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;"><a href="#&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;" class="headerlink" title="&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;"></a>&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;</h4><p>&#x7531;&#x4E8E;&#x56E0;&#x7279;&#x7F51;&#x672C;&#x8EAB;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x7684;&#x5206;&#x7EC4;&#x4F20;&#x8F93;&#xFF0C;TCP&#x5C31;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;<code>&#x786E;&#x8BA4;&#x673A;&#x5236;</code>&#x6765;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#xFF0C;&#x6210;&#x529F;&#x63A5;&#x6536;TCP&#x5206;&#x7EC4;&#x6570;&#x636E;&#x7684;&#x63A5;&#x6536;&#x8005;&#x90FD;&#x9700;&#x8981;&#x5411;&#x53D1;&#x9001;&#x8005;&#x56DE;&#x9001;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;<code>&#x786E;&#x8BA4;&#x5206;&#x7EC4;</code>&#xFF0C;&#x53D1;&#x9001;&#x8005;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x8FD9;&#x4E2A;<code>&#x786E;&#x8BA4;&#x5206;&#x7EC4;</code>&#xFF0C;&#x5C31;&#x8BA4;&#x4E3A;&#x4E4B;&#x524D;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x6210;&#x529F;&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x91CD;&#x53D1;&#x6570;&#x636E;</p>
<p>&#x4F46;&#x662F;&#x7531;&#x4E8E;<code>&#x786E;&#x8BA4;&#x5206;&#x7EC4;</code>&#x975E;&#x5E38;&#x7684;&#x5C0F;&#xFF0C;TCP&#x4E3A;&#x4E86;&#x6709;&#x6548;&#x7684;&#x5229;&#x7528;&#x7F51;&#x7EDC;&#xFF0C;&#x4F1A;&#x628A;<code>&#x786E;&#x8BA4;&#x5206;&#x7EC4;</code>&#x585E;&#x5230;&#x540C;&#x5411;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x4E2D;&#x53BB;&#xFF0C;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x53D1;&#x9001;&#x4F20;&#x8F93;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x540C;&#x5411;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x548B;&#x529E;&#xFF0C;&#x5C82;&#x4E0D;&#x662F;&#x4E00;&#x76F4;&#x4F1A;&#x91CD;&#x53D1;&#xFF1F;TCP&#x80AF;&#x5B9A;&#x4E0D;&#x4F1A;&#x5141;&#x8BB8;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x9001;&#x7684;&#xFF0C;TCP&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x79CD;<code>&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;</code>&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x7A97;&#x53E3;&#x65F6;&#x95F4;&#xFF08;&#x4E00;&#x822C;&#x662F;100~200&#x6BEB;&#x79D2;&#xFF09;&#xFF0C;<code>&#x786E;&#x8BA4;&#x5206;&#x7EC4;</code>&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x634E;&#x5E26;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;<code>&#x786E;&#x8BA4;&#x5206;&#x7EC4;</code>&#x5C31;&#x4F1A;&#x5355;&#x72EC;&#x53D1;&#x9001;</p>
<p>&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x4E4B;&#x524D;&#x7F16;&#x5199;TCP&#x957F;&#x8FDE;&#x63A5;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;<code>ACK&#x5305;</code>&#x673A;&#x5236;&#xFF0C;&#x5F53;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x9A6C;&#x4E0A;&#x4F1A;&#x56DE;&#x9001;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x5C42;&#x7684;<code>ACK&#x5305;</code>&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1A;&#x52A1;&#x5C42;&#x7684;<code>ACK&#x5305;</code>&#x5C31;&#x662F;&#x540C;&#x5411;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF0C;<code>&#x786E;&#x8BA4;&#x5206;&#x7EC4;</code>&#x9A6C;&#x4E0A;&#x4F1A;&#x88AB;&#x634E;&#x5E26;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;<code>&#x5EF6;&#x8FDF;&#x786E;&#x8BA4;</code>&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#x9891;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x90A3;&#x4EA7;&#x751F;&#x7684;<code>ACK</code>&#x5305;&#x5C31;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x591A;&#xFF0C;&#x518D;&#x5047;&#x8BBE;&#x4E1A;&#x52A1;&#x5C42;&#x7684;<code>ACK&#x5305;</code>&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x90A3;&#x4E48;&#x7684;&#x53CA;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7EC4;&#x5408;&#x4E1A;&#x52A1;&#x5C42;<code>ACK&#x5305;</code>&#x518D;&#x53D1;&#x9001;&#x5462;&#xFF1F;</p>
<h4 id="TCP&#x6162;&#x542F;&#x52A8;"><a href="#TCP&#x6162;&#x542F;&#x52A8;" class="headerlink" title="TCP&#x6162;&#x542F;&#x52A8;"></a>TCP&#x6162;&#x542F;&#x52A8;</h4><p>TCP&#x8FDE;&#x63A5;&#x7684;&#x6027;&#x80FD;&#x8FD8;&#x53D7;&#x5230;<code>&#x62E5;&#x585E;&#x63A7;&#x5236;</code>&#x673A;&#x5236;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5F53;TCP&#x8FDE;&#x63A5;&#x521A;&#x5F00;&#x59CB;&#x8FDE;&#x63A5;&#x4E0A;&#x65F6;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x4E00;&#x4E0B;&#x5B50;&#x5C31;&#x53D1;&#x9001;&#x5F88;&#x591A;&#x7684;&#x5206;&#x7EC4;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x53EA;&#x80FD;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x6536;&#x5230;<code>&#x786E;&#x8BA4;&#x5206;&#x7EC4;</code>&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x4E24;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x56DB;&#x4E2A;&#x5206;&#x7EC4;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;TCP&#x6162;&#x542F;&#x52A8;&#xFF0C;&#x53D1;&#x9001;&#x6570;&#x636E;&#x7684;&#x80FD;&#x529B;&#x662F;&#x6162;&#x6162;&#x63D0;&#x5347;&#x7684;</p>
<p>&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x7684;&#x662F;&#x957F;&#x8FDE;&#x63A5;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x5F71;&#x54CD;&#x5E76;&#x4E0D;&#x5927;</p>
<h4 id="Nagle&#x7B97;&#x6CD5;"><a href="#Nagle&#x7B97;&#x6CD5;" class="headerlink" title="Nagle&#x7B97;&#x6CD5;"></a>Nagle&#x7B97;&#x6CD5;</h4><p>&#x7531;&#x4E8E;TCP&#x5E76;&#x6CA1;&#x6709;&#x89C4;&#x5B9A;&#x6BCF;&#x4E2A;&#x5206;&#x7EC4;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6BCF;&#x6B21;&#x90FD;&#x4F20;&#x8F93;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;TCP&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x6807;&#x8BB0;&#x548C;&#x9996;&#x90E8;&#xFF08;&#x81F3;&#x5C11;40&#x4E2A;&#x5B57;&#x8282;&#xFF09;&#xFF0C;&#x5982;&#x679C;TCP&#x53D1;&#x9001;&#x5927;&#x91CF;&#x7684;&#x5305;&#x542B;&#x5C11;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5206;&#x7EC4;&#x65F6;&#xFF0C;&#x7F51;&#x7EDC;&#x7684;&#x771F;&#x5B9E;&#x5229;&#x7528;&#x7387;&#x5C31;&#x5F88;&#x4F4E;&#xFF0C;&#x7F51;&#x7EDC;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x4F1A;&#x4E25;&#x91CD;&#x7684;&#x4E0B;&#x964D;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5462;TCP&#x5229;&#x7528;&#x4E86;<code>Nagle&#x7B97;&#x6CD5;</code>&#xFF0C;&#x5728;&#x53D1;&#x9001;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x524D;&#xFF0C;&#x5C06;&#x5927;&#x91CF;TCP&#x6570;&#x636E;&#x7ED1;&#x5B9A;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x63D0;&#x9AD8;&#x7F51;&#x7EDC;&#x7684;&#x6548;&#x7387;&#x3002;<code>Nagle&#x7B97;&#x6CD5;</code>&#x9F13;&#x52B1;&#x53D1;&#x9001;&#x5168;&#x5C3A;&#x5BF8;&#x7684;&#x5206;&#x7EC4;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x6709;&#x5F53;&#x6240;&#x6709;&#x7684;&#x5206;&#x7EC4;&#x90FD;&#x88AB;&#x786E;&#x8BA4;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x53D1;&#x9001;&#x975E;&#x5168;&#x5C3A;&#x5BF8;&#x7684;&#x5206;&#x7EC4;&#xFF0C;&#x4E0D;&#x7136;&#x7684;&#x8BDD;&#x5C31;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x76F4;&#x5230;&#x79EF;&#x7D2F;&#x8DB3;&#x591F;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5168;&#x5C3A;&#x5BF8;&#x5206;&#x7EC4;&#x6570;&#x636E;&#x65F6;&#x624D;&#x4F1A;&#x5C06;&#x7F13;&#x5B58;&#x7684;&#x6570;&#x636E;&#x53D1;&#x9001;&#x51FA;&#x53BB;</p>
<p>&#x90A3;&#x8FD9;&#x4E2A;&#x5BF9;&#x6211;&#x4EEC;&#x7F16;&#x5199;TCP&#x957F;&#x8FDE;&#x63A5;&#x65F6;&#x6709;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#x5462;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;<code>&#x5FC3;&#x8DF3;&#x5305;</code>&#x548C;<code>ACK&#x5305;</code>&#x4E00;&#x822C;&#x90FD;&#x5F88;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;&#x670D;&#x52A1;&#x7AEF;&#x5C31;&#x4E0D;&#x80FD;&#x53CA;&#x65F6;&#x6536;&#x5230;&#x6211;&#x4EEC;&#x7684;<code>&#x5FC3;&#x8DF3;&#x5305;</code>&#x548C;<code>ACK&#x5305;</code>&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x65F6;&#x5EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x7981;&#x7528;<code>Nagle&#x7B97;&#x6CD5;</code></p>
<figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">Socket.setTcpNoDelay(<span class="keyword">true</span>);</span><br></pre></td></tr></table></figure>
<h4 id="TIME-WAIT&#x7D2F;&#x79EF;&#x4E0E;&#x7AEF;&#x53E3;&#x8017;&#x5C3D;"><a href="#TIME-WAIT&#x7D2F;&#x79EF;&#x4E0E;&#x7AEF;&#x53E3;&#x8017;&#x5C3D;" class="headerlink" title="TIME_WAIT&#x7D2F;&#x79EF;&#x4E0E;&#x7AEF;&#x53E3;&#x8017;&#x5C3D;"></a>TIME_WAIT&#x7D2F;&#x79EF;&#x4E0E;&#x7AEF;&#x53E3;&#x8017;&#x5C3D;</h4><p>&#x8FD9;&#x4E2A;&#x8DDF;&#x670D;&#x52A1;&#x7AEF;&#x76F8;&#x5173;&#xFF0C;&#x4E00;&#x822C;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;</p>

      
    </div>
    
    <div>
      
        
      
    </div>

    <div>
      
        
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Android/" rel="tag">#Android</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/03/04/DelayActions/" rel="next" title="DelayActions">
                <i class="fa fa-chevron-left"></i> DelayActions
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/03/20/数据预取小轮子/" rel="prev" title="数据预取小轮子">
                数据预取小轮子 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2018/03/10/Android端TCP长连接性能优化指北/"
           data-title="Android端TCP长连接的性能优化指北" data-url="http://yoursite.com/2018/03/10/Android端TCP长连接性能优化指北/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            全部文章
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="Pobi" />
          <p class="site-author-name" itemprop="name">Pobi</p>
          <p class="site-description motion-element" itemprop="description">因为喜爱，所以精彩</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">13</span>
              <span class="site-state-item-name">文章数</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#推送长连接"><span class="nav-number">1.</span> <span class="nav-text">推送长连接</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#影响TCP性能的点"><span class="nav-number">2.</span> <span class="nav-text">影响TCP性能的点</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#TCP连接的三次握手时延"><span class="nav-number">2.1.</span> <span class="nav-text">TCP连接的三次握手时延</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#延迟确认"><span class="nav-number">2.2.</span> <span class="nav-text">延迟确认</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#TCP慢启动"><span class="nav-number">2.3.</span> <span class="nav-text">TCP慢启动</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#Nagle算法"><span class="nav-number">2.4.</span> <span class="nav-text">Nagle算法</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#TIME-WAIT累积与端口耗尽"><span class="nav-number">2.5.</span> <span class="nav-text">TIME_WAIT累积与端口耗尽</span></a></li></ol></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2020</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Pobi</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"tubb"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
